"GENERAL PREFERENCES" = "Γενικές Προτιμήσεις";
"TURN ON 3G WHEN NO INTERNET ACCESS AVAILABLE" = "Ενεργοποίηση του 3G όταν δεν υπάρχει σύνδεση με το ίντερνετ";
"HIDE ICON" = "Κρύψιμο Εικονιδίου";
"SAVE TO LIBRARY" = "Αποθήκευση στην βιβλιοθήκη";
"AUTO TURN ON WIFI" = "Αυτόματη ενεργοποίηση του WiFi";
"AUTO TURN ON 3G" = "Αυτόματη ενεργοποίηση του 3G";
"GENERAL SETTINGS" = "Γενικές Ρυθμίσεις";